Catalogs/ГруппыВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ГруппыВиджетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоКолонок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Схема</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Виджет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Виджеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/УровниМатрицыТалантов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>УровниМатрицыТалантов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Уровень1C</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уровень1B</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уровень1A</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уровень2C</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уровень2B</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уровень2A</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уровень3C</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уровень3B</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уровень3A</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДействияВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДействияВиджетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НичегоНеДелать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытьФормуСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходПоСсылке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитьАлгоритм</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Виджеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Виджеты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиВиджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаВиджета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоказателейДляВывода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаВиджета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПодвала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиВиджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВМатрицеТалантов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиВиджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПоказателиВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПоказателиВиджетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияВиджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыВиджетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает данные группы виджетов.
// 
// Параметры:
//  ГруппаВиджетов - СправочникСсылка.ГруппыВиджетов.
//  ИмяРодителя - Строка.
// 
// Возвращаемое значение:
//  Структура - Данные группы виджетов. См. Справочнники.ГруппыВиджетов.НовыйДанныеГруппыВиджетов().
//
Функция ДанныеГруппыВиджетов(ГруппаВиджетов, ИмяРодителя = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ГруппаВиджетов) Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Не найдена группы виджетов %1.'"),
			ГруппаВиджетов);
	КонецЕсли;
	
	РеквизитыГруппыВиджетов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ГруппаВиджетов,
		 "Наименование, ИмяПредопределенныхДанных, КоличествоКолонок, КоличествоСтрок");
	
	ДанныеВиджетов = Новый Соответствие;
	
	ДанныеГруппыВиджетов = НовыйДанныеГруппыВиджетов();
	ДанныеГруппыВиджетов.Имя =
		?(ЗначениеЗаполнено(РеквизитыГруппыВиджетов.ИмяПредопределенныхДанных),
			РеквизитыГруппыВиджетов.ИмяПредопределенныхДанных,
			СтрЗаменить(Строка(ГруппаВиджетов.УникальныйИдентификатор()), "-", ""));
	ДанныеГруппыВиджетов.Наименование = РеквизитыГруппыВиджетов.Наименование;
	ДанныеГруппыВиджетов.Элементы = ЭлементыГруппыВиджетов(ГруппаВиджетов, РеквизитыГруппыВиджетов, ДанныеВиджетов, ИмяРодителя);
	
	Возврат ДанныеГруппыВиджетов;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
// Параметры:
//  ПолноеИмяОбъекта - Строка - имя объекта, для которого вызывается заполнение.
//  Настройки - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов.Настройки
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(ПолноеИмяОбъекта, Настройки) Экспорт
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
//
// Параметры:
//  КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//  Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//  ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	ЗаполнитьГруппуМатрицыТалантов();
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
//
// Параметры:
//  Объект                  - СправочникОбъект.РолиИсполнителей - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(ПолноеИмяОбъекта, Объект, Данные, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьГруппуМатрицыТалантов(ПараметрыОбновления = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ГруппыВиджетов");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		
		ГруппаМатрицы = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ГруппыВиджетов.МатрицаТалантов");
		Если ГруппаМатрицы = Неопределено Тогда
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			Возврат;
		КонецЕсли;
		
		ГруппаМатрицыОбъект = ГруппаМатрицы.ПолучитьОбъект();
		ГруппаМатрицыОбъект.КоличествоКолонок = 3;
		ГруппаМатрицыОбъект.КоличествоСтрок = 3;
		
		Если ГруппаМатрицыОбъект.Схема.Количество() > 0 Тогда
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			Возврат;
		КонецЕсли;
		
		Виджеты = МассивВиджетовМатрицыТалантов();
		Если Виджеты = Неопределено Или Виджеты.Найти(Неопределено) <> Неопределено Тогда
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			Возврат;
		КонецЕсли;
		
		Индекс = 0;
		Для ПозицияСтроки = 1 По 3 Цикл
			Для ПозицияКолонки = 1 По 3 Цикл
				НоваяСтрока = ГруппаМатрицыОбъект.Схема.Добавить();
				НоваяСтрока.Виджет = Виджеты[Индекс];
				НоваяСтрока.ПозицияСтроки = ПозицияСтроки;
				НоваяСтрока.ПозицияКолонки = ПозицияКолонки;
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ГруппаМатрицыОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйДанныеГруппыВиджетов()
	
	ДанныеРабочегоСтола = Новый Структура;
	ДанныеРабочегоСтола.Вставить("Имя", "");
	ДанныеРабочегоСтола.Вставить("Наименование", "");
	ДанныеРабочегоСтола.Вставить("Элементы", НовыйЭлементыГруппыВиджетов());
	
	Возврат ДанныеРабочегоСтола;
	
КонецФункции

Функция НовыйЭлементыГруппыВиджетов()
	
	ЭлементыРабочегоСтола = Новый ТаблицаЗначений;
	ЭлементыРабочегоСтола.Колонки.Добавить("Имя");
	ЭлементыРабочегоСтола.Колонки.Добавить("Родитель");
	ЭлементыРабочегоСтола.Колонки.Добавить("ЭтоГруппа");
	ЭлементыРабочегоСтола.Колонки.Добавить("Группировка");
	
	ЭлементыРабочегоСтола.Колонки.Добавить("Виджет");
	ЭлементыРабочегоСтола.Колонки.Добавить("ДанныеВиджета");
	ЭлементыРабочегоСтола.Колонки.Добавить("ЭлементФормы");
	
	Возврат ЭлементыРабочегоСтола
	
КонецФункции

Функция ЭлементыГруппыВиджетов(ГруппаВиджетов, ДанныеГруппыВиджетов, ДанныеВиджетов, Родитель = "")
	
	ЭлементыГруппыВиджетов = НовыйЭлементыГруппыВиджетов();
	
	СхемаГруппыВиджетов = СхемаГруппыВиджетов(ГруппаВиджетов, ДанныеГруппыВиджетов, ДанныеВиджетов);
	
	ЭлементГруппыВиджетов = ЭлементыГруппыВиджетов.Добавить();
	ЭлементГруппыВиджетов.Имя = "КолонкиВиджетов";
	ЭлементГруппыВиджетов.Родитель = Родитель;
	ЭлементГруппыВиджетов.ЭтоГруппа = Истина;
	ЭлементГруппыВиджетов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	Для НомерКолонки = 1 По ДанныеГруппыВиджетов.КоличествоКолонок Цикл
		
		ИмяГруппыКолонок = СтрШаблон("КолонкаВиджетов%1", НомерКолонки);
		ЭлементГруппыВиджетов = ЭлементыГруппыВиджетов.Добавить();
		ЭлементГруппыВиджетов.Имя = ИмяГруппыКолонок;
		ЭлементГруппыВиджетов.Родитель = "КолонкиВиджетов";
		ЭлементГруппыВиджетов.ЭтоГруппа = Истина;
		ЭлементГруппыВиджетов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		Для НомерСтроки = 1 По ДанныеГруппыВиджетов.КоличествоСтрок Цикл
			
			ИмяВиджета = СтрШаблон("Виджет%1_%2", НомерКолонки, НомерСтроки);
			ЭлементГруппыВиджетов = ЭлементыГруппыВиджетов.Добавить();
			
			ЭлементГруппыВиджетов.Имя = СтрШаблон(ИмяВиджета);
			ЭлементГруппыВиджетов.Родитель = ИмяГруппыКолонок;
			ЭлементГруппыВиджетов.ЭтоГруппа = Ложь;
			СхемаГруппыВиджетов.Свойство(ИмяВиджета, ЭлементГруппыВиджетов.Виджет);
			
			ЭлементГруппыВиджетов.ДанныеВиджета = ДанныеВиджетов[ЭлементГруппыВиджетов.Виджет];
		КонецЦикла;
		
		
	КонецЦикла;
	
	Возврат ЭлементыГруппыВиджетов;
	
КонецФункции

// Формирует схему групп виджетов
//
// Параметры:
//  ГруппаВиджетов - СправочникСсылка.ГруппыВиджетов.
//  РеквизитыГруппыВиджетов - Структура.
//   * КоличествоКолонок - Число.
//   * КоличествоСтрок - Число.
//  ДанныеВиджетов - Соответствие.
//
// Возвращаемое значение:
//  Структура - Схема группы виджетов. См. Справочники.ГруппыВиджетов.СхемаГруппыВиджетов().
//
Функция СхемаГруппыВиджетов(ГруппаВиджетов, ДанныеГруппыВиджетов, ДанныеВиджетов)
	
	СхемаГруппыВиджетов = НоваяСхемаГруппыВиджетов(ДанныеГруппыВиджетов);
	
	Если Не ЗначениеЗаполнено(ГруппаВиджетов) Тогда
		Возврат СхемаГруппыВиджетов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ГруппыВиджетовСхема.Виджет КАК Виджет,
		|	ГруппыВиджетовСхема.ПозицияСтроки КАК ПозицияСтроки,
		|	ГруппыВиджетовСхема.ПозицияКолонки КАК ПозицияКолонки
		|ИЗ
		|	Справочник.ГруппыВиджетов.Схема КАК ГруппыВиджетовСхема
		|ГДЕ
		|	ГруппыВиджетовСхема.Ссылка = &ГруппаВиджетов";
	
	Запрос.УстановитьПараметр("ГруппаВиджетов", ГруппаВиджетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивВиджетов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		ИмяВиджетаВСхеме = СтрШаблон("Виджет%1_%2", Выборка.ПозицияКолонки, Выборка.ПозицияСтроки);
		Если СхемаГруппыВиджетов.Свойство(ИмяВиджетаВСхеме) Тогда
			СхемаГруппыВиджетов[ИмяВиджетаВСхеме] = Выборка.Виджет;
		КонецЕсли;
		
		МассивВиджетов.Добавить(Выборка.Виджет);
		
	КонецЦикла;
	
	ДанныеВиджетов = Справочники.Виджеты.ДанныеВиджетов(МассивВиджетов);
	
	Возврат СхемаГруппыВиджетов;
	
КонецФункции

Функция НоваяСхемаГруппыВиджетов(ДанныеГруппыВиджетов)
	
	СхемаГруппыВиджетов = Новый Структура;
	Если ДанныеГруппыВиджетов.КоличествоКолонок = 0 Или ДанныеГруппыВиджетов.КоличествоСтрок = 0 Тогда
		Возврат СхемаГруппыВиджетов;
	КонецЕсли;
	
	Для НомерКолонки = 1 По ДанныеГруппыВиджетов.КоличествоКолонок Цикл
		Для НомерСтроки = 1 По ДанныеГруппыВиджетов.КоличествоСтрок Цикл
			
			СхемаГруппыВиджетов.Вставить(СтрШаблон("Виджет%1_%2", НомерКолонки, НомерСтроки), "");
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат СхемаГруппыВиджетов;
	
КонецФункции

Функция МассивВиджетовМатрицыТалантов()
	
	АлгоритмыПоказателей = АлгоритмыПоказателей();
	
	СветлоОранжевый = ЦветаСтиля.ЦветВиджетаСветлоОранжевый;
	СветлоЗеленый = ЦветаСтиля.ЦветВиджетаСветлоЗеленый;
	Оранжевый = ЦветаСтиля.ЦветВиджетаОранжевый;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.Виджеты");
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных.Заблокировать();
		
		Виджеты = Новый Массив;
		Виджеты.Добавить(СоздатьВиджет(НСтр("ru = 'Потенциально ценный'"), "Уровень1C", СветлоОранжевый, АлгоритмыПоказателей, Истина));
		Виджеты.Добавить(СоздатьВиджет(НСтр("ru = 'Потенциальная звезда'"), "Уровень1B", СветлоЗеленый, АлгоритмыПоказателей, Истина));
		Виджеты.Добавить(СоздатьВиджет(НСтр("ru = 'Звезда'"), "Уровень1A", ЦветаСтиля.ЦветВиджетаЗеленый, АлгоритмыПоказателей, Истина));
		Виджеты.Добавить(СоздатьВиджет(НСтр("ru = 'Непостоянный сотрудник'"), "Уровень2C", Оранжевый, АлгоритмыПоказателей, Истина));
		Виджеты.Добавить(СоздатьВиджет(НСтр("ru = 'Основной сотрудник'"), "Уровень2B", СветлоОранжевый, АлгоритмыПоказателей, Истина));
		Виджеты.Добавить(СоздатьВиджет(НСтр("ru = 'Высокопроизводительный'"), "Уровень2A", СветлоЗеленый, АлгоритмыПоказателей, Истина));
		Виджеты.Добавить(СоздатьВиджет(НСтр("ru = 'Зона риска'"), "Уровень3C", ЦветаСтиля.ЦветВиджетаКрасный, АлгоритмыПоказателей, Истина));
		Виджеты.Добавить(СоздатьВиджет(НСтр("ru = 'Рядовой сотрудник'"), "Уровень3B", Оранжевый, АлгоритмыПоказателей, Истина));
		Виджеты.Добавить(СоздатьВиджет(НСтр("ru = 'Надежный исполнитель'"), "Уровень3A", СветлоОранжевый, АлгоритмыПоказателей, Истина));
		
		ЗафиксироватьТранзакцию();
		Возврат Виджеты;
	Исключение
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция АлгоритмыПоказателей()
	
	Алгоритм = Новый Массив;
	Алгоритм.Добавить("Уровень = ПредопределенноеЗначение(""Перечисление.УровниМатрицыТалантов.%1"");");
	Алгоритм.Добавить("Форма.Элементы.ЗаголовокТаблицы.Заголовок = СтрокаДействия.Заголовок;");
	Алгоритм.Добавить("Форма.Элементы.ГруппаПоказателиСотрудников.Видимость = Истина;");
	Алгоритм.Добавить("Отбор = Новый Структура(""УровеньСсылка"", Уровень);");
	Алгоритм.Добавить("Форма.Элементы.ПоказателиСотрудников.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);");
	ВыражениеПодвала = Новый Массив;
	ВыражениеПодвала.Добавить("Отбор = Новый Структура(""УровеньСсылка"", Перечисления.УровниМатрицыТалантов.%1);");
	ВыражениеПодвала.Добавить("Параметры.Результат = ""Всего: "" + Параметры.Форма.ПоказателиСотрудников.НайтиСтроки(Отбор).Количество();");
	ВыражениеПоказателя = Новый Массив;
	ВыражениеПоказателя.Добавить("Отбор = Новый Структура(""УровеньСсылка"", Перечисления.УровниМатрицыТалантов.%1);");
	ВыражениеПоказателя.Добавить("ТЗ = Параметры.Форма.ПоказателиСотрудников.Выгрузить(Отбор, ""Сотрудник"");");
	ВыражениеПоказателя.Добавить("Параметры.Результат = ТЗ.ВыгрузитьКолонку(""Сотрудник"");");
	
	АлгоритмыПоказателей = Новый Структура;
	АлгоритмыПоказателей.Вставить("Алгоритм", СтрСоединить(Алгоритм, Символы.ПС));
	АлгоритмыПоказателей.Вставить("ВыражениеПодвала", СтрСоединить(ВыражениеПодвала, Символы.ПС));
	АлгоритмыПоказателей.Вставить("ВыражениеПоказателя", СтрСоединить(ВыражениеПоказателя, Символы.ПС));
	
	Возврат АлгоритмыПоказателей;
	
КонецФункции

Функция СоздатьВиджет(Наименование, Уровень, Цвет, АлгоритмыПоказателей, ЭтоМатрицаТалантов = Ложь)
	
	Виджет = Справочники.Виджеты.СоздатьЭлемент();
	Виджет.УстановитьНовыйКод();
	Виджет.Наименование = Наименование;
	Виджет.Цвет = Новый ХранилищеЗначения(Цвет);
	Виджет.ШиринаВиджета = 28;
	Виджет.ВысотаВиджета = 12;
	Виджет.КоличествоПоказателейДляВывода = 4;
	Виджет.ПоказательЗаголовка = СформироватьПоказатель(Наименование, Уровень, Истина, АлгоритмыПоказателей.Алгоритм);
	Виджет.ИспользуетсяВМатрицеТалантов = ЭтоМатрицаТалантов;
	
	НаименованиеПодвала = СтрШаблон("%1: Всего", Наименование);
	Виджет.ПоказательПодвала = СформироватьПоказатель(
		НаименованиеПодвала,
		Уровень,
		Ложь,
		АлгоритмыПоказателей.Алгоритм,
		АлгоритмыПоказателей.ВыражениеПодвала);
		
	НаименованиеПоказателя = СтрШаблон(НСтр("ru = '%1: Список сотрудников'"), Наименование);
	ПоказательДанных = СформироватьПоказатель(НаименованиеПоказателя, Уровень, Ложь,, АлгоритмыПоказателей.ВыражениеПоказателя);
	
	Если ЗначениеЗаполнено(ПоказательДанных) Тогда
		НоваяСтрока = Виджет.ОсновныеПоказатели.Добавить();
		НоваяСтрока.Показатель = ПоказательДанных;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Виджет, Ложь, Ложь);
	
	Возврат Виджет.Ссылка;
	
КонецФункции

Функция СформироватьПоказатель(Наименование, Уровень, ЭтоЗаголовок, Алгоритм = "", Выражение = "")
	
	Показатель = Справочники.ПоказателиВиджетов.СоздатьЭлемент();
	Показатель.УстановитьНовыйКод();
	Показатель.Наименование = Наименование;
	Шрифт = ?(ЭтоЗаголовок, ШрифтыСтиля.ШрифтЗаголовкаВиджета, ШрифтыСтиля.ШрифтДанныхВиджета);
	Показатель.Шрифт = Новый ХранилищеЗначения(Шрифт);
	Если ЗначениеЗаполнено(Алгоритм) Тогда
		Показатель.Действие = Перечисления.ДействияВиджетов.ВыполнитьАлгоритм;
		Показатель.АлгоритмДействия = СтрШаблон(Алгоритм, Уровень);
	Иначе
		Показатель.Действие = Перечисления.ДействияВиджетов.ПереходПоСсылке;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выражение) Тогда
		Показатель.Выражение = СтрШаблон(Выражение, Уровень);
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Показатель, Ложь, Ложь);
	
	Возврат Показатель.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
